esp8266/Arduino/libraries/ESP8266WiFiMesh/src/EspnowMeshBackend.cpp
EspnowMeshBackend *EspnowMeshBackend::getEspnowRequestManager() {return _espnowRequestManager;}

bool EspnowMeshBackend::isEspnowRequestManager() const
{
  return (this == getEspnowRequestManager());
}

void EspnowMeshBackend::setLogEntryLifetimeMs(const uint32_t logEntryLifetimeMs)
{
  EspnowDatabase::setLogEntryLifetimeMs(logEntryLifetimeMs);
}
uint32_t EspnowMeshBackend::logEntryLifetimeMs() { return EspnowDatabase::logEntryLifetimeMs(); }

void EspnowMeshBackend::setBroadcastResponseTimeoutMs(const uint32_t broadcastResponseTimeoutMs)
{
  EspnowDatabase::setBroadcastResponseTimeoutMs(broadcastResponseTimeoutMs);
}
uint32_t EspnowMeshBackend::broadcastResponseTimeoutMs() { return EspnowDatabase::broadcastResponseTimeoutMs(); }

void EspnowMeshBackend::setCriticalHeapLevelBuffer(const uint32_t bufferInBytes)
{
  EspnowDatabase::setCriticalHeapLevelBuffer(bufferInBytes);
}

uint32_t EspnowMeshBackend::criticalHeapLevelBuffer()
{
  return EspnowDatabase::criticalHeapLevelBuffer();
}

uint32_t EspnowMeshBackend::criticalHeapLevel()
{
  return EspnowDatabase::criticalHeapLevel();
}

void EspnowMeshBackend::setEspnowTransmissionTimeout(const uint32_t timeoutMs)
{
  EspnowTransmitter::setEspnowTransmissionTimeout(timeoutMs);
}
uint32_t EspnowMeshBackend::getEspnowTransmissionTimeout() {return EspnowTransmitter::getEspnowTransmissionTimeout();}

void EspnowMeshBackend::setEspnowRetransmissionInterval(const uint32_t intervalMs)
{
  EspnowTransmitter::setEspnowRetransmissionInterval(intervalMs);
}
uint32_t EspnowMeshBackend::getEspnowRetransmissionInterval() {return EspnowTransmitter::getEspnowRetransmissionInterval();}

void EspnowMeshBackend::setEncryptionRequestTimeout(const uint32_t timeoutMs)
{
  EspnowDatabase::setEncryptionRequestTimeout(timeoutMs);
}
uint32_t EspnowMeshBackend::getEncryptionRequestTimeout() {return EspnowDatabase::getEncryptionRequestTimeout();}

void EspnowMeshBackend::setAutoEncryptionDuration(const uint32_t duration)
{
  _database.setAutoEncryptionDuration(duration);
}
uint32_t EspnowMeshBackend::getAutoEncryptionDuration() const {return _database.getAutoEncryptionDuration();}

void EspnowMeshBackend::setBroadcastFilter(const broadcastFilterType broadcastFilter) {_broadcastFilter = broadcastFilter;}
EspnowMeshBackend::broadcastFilterType EspnowMeshBackend::getBroadcastFilter() const {return _broadcastFilter;}

void EspnowMeshBackend::setEspnowEncryptedConnectionKey(const uint8_t espnowEncryptedConnectionKey[encryptedConnectionKeyLength])
{
  _connectionManager.setEspnowEncryptedConnectionKey(espnowEncryptedConnectionKey);
}

void EspnowMeshBackend::setEspnowEncryptedConnectionKey(const String &espnowEncryptedConnectionKeySeed)
{
  _connectionManager.setEspnowEncryptedConnectionKey(espnowEncryptedConnectionKeySeed);
}

const uint8_t *EspnowMeshBackend::getEspnowEncryptedConnectionKey() const
{
  return _connectionManager.getEspnowEncryptedConnectionKey();
}

uint8_t *EspnowMeshBackend::getEspnowEncryptedConnectionKey(uint8_t resultArray[encryptedConnectionKeyLength]) const
{
  return _connectionManager.getEspnowEncryptedConnectionKey(resultArray);
}

bool EspnowMeshBackend::setEspnowEncryptionKok(uint8_t espnowEncryptionKok[encryptedConnectionKeyLength])
{
  return EspnowConnectionManager::setEspnowEncryptionKok(espnowEncryptionKok);
}

bool EspnowMeshBackend::setEspnowEncryptionKok(const String &espnowEncryptionKokSeed)
{
  return EspnowConnectionManager::setEspnowEncryptionKok(espnowEncryptionKokSeed);
}

const uint8_t *EspnowMeshBackend::getEspnowEncryptionKok()
{
  return EspnowConnectionManager::getEspnowEncryptionKok();
}

void EspnowMeshBackend::setEspnowHashKey(const uint8_t espnowHashKey[hashKeyLength])
{
  _connectionManager.setEspnowHashKey(espnowHashKey);
}

void EspnowMeshBackend::setEspnowHashKey(const String &espnowHashKeySeed)
{
  _connectionManager.setEspnowHashKey(espnowHashKeySeed);
}

const uint8_t *EspnowMeshBackend::getEspnowHashKey() const
{
  return _connectionManager.getEspnowHashKey();
}

void EspnowMeshBackend::setUseEncryptedMessages(const bool useEncryptedMessages) 
{
  EspnowTransmitter::setUseEncryptedMessages(useEncryptedMessages);
}
bool EspnowMeshBackend::useEncryptedMessages() { return EspnowTransmitter::useEncryptedMessages(); }

void EspnowMeshBackend::setEspnowMessageEncryptionKey(const uint8_t espnowMessageEncryptionKey[experimental::crypto::ENCRYPTION_KEY_LENGTH])
{
  EspnowTransmitter::setEspnowMessageEncryptionKey(espnowMessageEncryptionKey);
}

void EspnowMeshBackend::setEspnowMessageEncryptionKey(const String &espnowMessageEncryptionKeySeed)
{
  EspnowTransmitter::setEspnowMessageEncryptionKey(espnowMessageEncryptionKeySeed);
}

const uint8_t *EspnowMeshBackend::getEspnowMessageEncryptionKey()
{
  return EspnowTransmitter::getEspnowMessageEncryptionKey();
}

String EspnowMeshBackend::getScheduledResponseMessage(const uint32_t responseIndex)
{
  return EspnowDatabase::getScheduledResponseMessage(responseIndex);
}

const uint8_t *EspnowMeshBackend::getScheduledResponseRecipient(const uint32_t responseIndex)
{
  return EspnowDatabase::getScheduledResponseRecipient(responseIndex);
}

uint32_t EspnowMeshBackend::numberOfScheduledResponses() {return EspnowDatabase::numberOfScheduledResponses();}

void EspnowMeshBackend::clearAllScheduledResponses()
{
  EspnowDatabase::clearAllScheduledResponses();
}

void EspnowMeshBackend::deleteScheduledResponsesByRecipient(const uint8_t *recipientMac, const bool encryptedOnly)
{
  EspnowDatabase::deleteScheduledResponsesByRecipient(recipientMac, encryptedOnly);
}

String EspnowMeshBackend::getSenderMac() const {return _database.getSenderMac();}
uint8_t *EspnowMeshBackend::getSenderMac(uint8_t *macArray) const
{
  return _database.getSenderMac(macArray);
}

String EspnowMeshBackend::getSenderAPMac() const {return _database.getSenderAPMac();}
uint8_t *EspnowMeshBackend::getSenderAPMac(uint8_t *macArray) const
{
  return _database.getSenderAPMac(macArray);
}

bool EspnowMeshBackend::receivedEncryptedTransmission() const {return _encryptionBroker.receivedEncryptedTransmission();}

bool EspnowMeshBackend::addUnencryptedConnection(const String &serializedConnectionState)
{
  return EspnowConnectionManager::addUnencryptedConnection(serializedConnectionState);
}

EncryptedConnectionStatus EspnowMeshBackend::addEncryptedConnection(uint8_t *peerStaMac, uint8_t *peerApMac, const uint64_t peerSessionKey, const uint64_t ownSessionKey)
{
  return _connectionManager.addEncryptedConnection(peerStaMac, peerApMac, peerSessionKey, ownSessionKey);
}

EncryptedConnectionStatus EspnowMeshBackend::addEncryptedConnection(const String &serializedConnectionState, const bool ignoreDuration)
{
  return _connectionManager.addEncryptedConnection(serializedConnectionState, ignoreDuration);
}

EncryptedConnectionStatus EspnowMeshBackend::addTemporaryEncryptedConnection(uint8_t *peerStaMac, uint8_t *peerApMac, const uint64_t peerSessionKey, const uint64_t ownSessionKey, const uint32_t duration)
{  
  return _connectionManager.addTemporaryEncryptedConnection(peerStaMac, peerApMac, peerSessionKey, ownSessionKey, duration);
}

EncryptedConnectionStatus EspnowMeshBackend::addTemporaryEncryptedConnection(const String &serializedConnectionState, const uint32_t duration)
{
  return _connectionManager.addTemporaryEncryptedConnection(serializedConnectionState, duration);
}

EncryptedConnectionStatus EspnowMeshBackend::requestEncryptedConnection(const uint8_t *peerMac)
{
  return _encryptionBroker.requestEncryptedConnection(peerMac, *this);
}

EncryptedConnectionStatus EspnowMeshBackend::requestTemporaryEncryptedConnection(const uint8_t *peerMac, const uint32_t durationMs)
{
  return _encryptionBroker.requestTemporaryEncryptedConnection(peerMac, durationMs, *this);
}

EncryptedConnectionStatus EspnowMeshBackend::requestFlexibleTemporaryEncryptedConnection(const uint8_t *peerMac, const uint32_t minDurationMs)
{
  return _encryptionBroker.requestFlexibleTemporaryEncryptedConnection(peerMac, minDurationMs, *this);
}

EncryptedConnectionRemovalOutcome EspnowMeshBackend::removeEncryptedConnection(const uint8_t *peerMac)
{
  return EspnowConnectionManager::removeEncryptedConnection(peerMac);
}

EncryptedConnectionRemovalOutcome EspnowMeshBackend::requestEncryptedConnectionRemoval(const uint8_t *peerMac)
{
  return _encryptionBroker.requestEncryptedConnectionRemoval(peerMac);
}

void EspnowMeshBackend::setAcceptsUnverifiedRequests(const bool acceptsUnverifiedRequests)  { _acceptsUnverifiedRequests = acceptsUnverifiedRequests; }
bool EspnowMeshBackend::acceptsUnverifiedRequests() const { return _acceptsUnverifiedRequests; }

void EspnowMeshBackend::setEncryptedConnectionsSoftLimit(const uint8_t softLimit) 
{ 
  _connectionManager.setEncryptedConnectionsSoftLimit(softLimit);
}

uint8_t EspnowMeshBackend::encryptedConnectionsSoftLimit() const { return _connectionManager.encryptedConnectionsSoftLimit(); }

uint8_t *EspnowMeshBackend::getEncryptedMac(const uint8_t *peerMac, uint8_t *resultArray)
{
  return EspnowConnectionManager::getEncryptedMac(peerMac, resultArray);
}

