esp8266/Arduino/libraries/ESP8266WiFiMesh/src/EspnowMeshBackend.cpp
      latestTransmissionOutcomes().push_back(TransmissionOutcome{.origin = currentNetwork, .transmissionStatus = transmissionResult});
  
      _encryptionBroker.finalizeAutoEncryptingConnection(currentBSSID, existingEncryptedConnection, requestPermanentConnections);
  
      if(!getTransmissionOutcomesUpdateHook()(*this))
        break;
    }
  }

  printTransmissionStatistics();
}

TransmissionStatusType EspnowMeshBackend::attemptAutoEncryptingTransmission(const String &message, const EspnowNetworkInfo &recipientInfo, const bool requestPermanentConnection)
{
  uint8_t targetBSSID[6] {0};
  EncryptedConnectionLog *existingEncryptedConnection = nullptr;
  EncryptedConnectionStatus connectionStatus = _encryptionBroker.initiateAutoEncryptingConnection(recipientInfo, requestPermanentConnection, targetBSSID, &existingEncryptedConnection, *this);

  MutexTracker mutexTracker(EspnowTransmitter::captureEspnowTransmissionMutex(EspnowConnectionManager::handlePostponedRemovals));
  if(!mutexTracker.mutexCaptured())
  {
    assert(false && String(F("ERROR! Transmission in progress. Don't call attemptTransmission from callbacks as this may corrupt program state! Aborting."))); 
    return TransmissionStatusType::CONNECTION_FAILED;
  }

  TransmissionStatusType transmissionResult = initiateAutoEncryptingTransmission(message, targetBSSID, connectionStatus);

  _encryptionBroker.finalizeAutoEncryptingConnection(targetBSSID, existingEncryptedConnection, requestPermanentConnection);

  return transmissionResult;
}

void EspnowMeshBackend::broadcast(const String &message)
{  
  MutexTracker mutexTracker(EspnowTransmitter::captureEspnowTransmissionMutex(EspnowConnectionManager::handlePostponedRemovals));
  if(!mutexTracker.mutexCaptured())
  {
    assert(false && String(F("ERROR! Transmission in progress. Don't call broadcast from callbacks as this may corrupt program state! Aborting."))); 
    return;
  }

  EspnowTransmitter::espnowSendToNode(message, EspnowProtocolInterpreter::broadcastMac, 'B', this);
}

void EspnowMeshBackend::setBroadcastTransmissionRedundancy(const uint8_t redundancy) { _transmitter.setBroadcastTransmissionRedundancy(redundancy); }
uint8_t EspnowMeshBackend::getBroadcastTransmissionRedundancy() const { return _transmitter.getBroadcastTransmissionRedundancy(); }

void EspnowMeshBackend::setResponseTransmittedHook(const EspnowTransmitter::responseTransmittedHookType responseTransmittedHook) { _transmitter.setResponseTransmittedHook(responseTransmittedHook); }
EspnowTransmitter::responseTransmittedHookType EspnowMeshBackend::getResponseTransmittedHook() const { return _transmitter.getResponseTransmittedHook(); }

EspnowDatabase *EspnowMeshBackend::getDatabase() { return &_database; }
const EspnowDatabase *EspnowMeshBackend::getDatabaseConst() const { return &_database; }
EspnowConnectionManager *EspnowMeshBackend::getConnectionManager() { return &_connectionManager; }
const EspnowConnectionManager *EspnowMeshBackend::getConnectionManagerConst() const { return &_connectionManager; }
EspnowTransmitter *EspnowMeshBackend::getTransmitter() { return &_transmitter; }
const EspnowTransmitter *EspnowMeshBackend::getTransmitterConst() const { return &_transmitter; }
EspnowEncryptionBroker *EspnowMeshBackend::getEncryptionBroker() { return &_encryptionBroker; }
const EspnowEncryptionBroker *EspnowMeshBackend::getEncryptionBrokerConst() const { return &_encryptionBroker; }

void EspnowMeshBackend::sendStoredEspnowMessages(const ExpiringTimeTracker *estimatedMaxDurationTracker)
{
  EspnowEncryptionBroker::sendPeerRequestConfirmations(estimatedMaxDurationTracker);

  if(estimatedMaxDurationTracker && estimatedMaxDurationTracker->expired())
    return;

  EspnowTransmitter::sendEspnowResponses(estimatedMaxDurationTracker);
}

uint32_t EspnowMeshBackend::getMaxMessageBytesPerTransmission()
{
  return EspnowProtocolInterpreter::getMaxMessageBytesPerTransmission();
}

void EspnowMeshBackend::setMaxTransmissionsPerMessage(const uint8_t maxTransmissionsPerMessage)
{
  EspnowTransmitter::setMaxTransmissionsPerMessage(maxTransmissionsPerMessage);
}

uint8_t EspnowMeshBackend::getMaxTransmissionsPerMessage() {return EspnowTransmitter::getMaxTransmissionsPerMessage();}

uint32_t EspnowMeshBackend::getMaxMessageLength()
{
  return EspnowTransmitter::getMaxMessageLength();
}

void EspnowMeshBackend::setVerboseModeState(const bool enabled) {(*getConditionalPrinter()).setVerboseModeState(enabled); ConditionalPrinter::setStaticVerboseModeState(enabled);}
bool EspnowMeshBackend::verboseMode() const {return ConditionalPrinter::staticVerboseMode();}

void EspnowMeshBackend::verboseModePrint(const String &stringToPrint, const bool newline) const
{
  (*getConditionalPrinterConst()).verboseModePrint(stringToPrint, newline);
}

bool EspnowMeshBackend::staticVerboseMode() {return ConditionalPrinter::staticVerboseMode();}
void EspnowMeshBackend::staticVerboseModePrint(const String &stringToPrint, const bool newline)
{
  ConditionalPrinter::staticVerboseModePrint(stringToPrint, newline);
}

uint8_t EspnowMeshBackend::numberOfEncryptedConnections()
{
  return EspnowConnectionManager::numberOfEncryptedConnections();
}

ConnectionType EspnowMeshBackend::getConnectionInfo(uint8_t *peerMac, uint32_t *remainingDuration)
{
  return EspnowConnectionManager::getConnectionInfo(peerMac, remainingDuration);
}

ConnectionType EspnowMeshBackend::getConnectionInfo(const uint32_t connectionIndex, uint32_t *remainingDuration, uint8_t *peerMac)
{
  return EspnowConnectionManager::getConnectionInfo(connectionIndex, remainingDuration, peerMac);
}

double EspnowMeshBackend::getTransmissionFailRate()
{
  return EspnowTransmitter::getTransmissionFailRate();
}

void EspnowMeshBackend::resetTransmissionFailRate()
{
  EspnowTransmitter::resetTransmissionFailRate();
}

String EspnowMeshBackend::serializeUnencryptedConnection()
{
  return EspnowConnectionManager::serializeUnencryptedConnection();
}

String EspnowMeshBackend::serializeEncryptedConnection(const uint8_t *peerMac)
{
  return EspnowConnectionManager::serializeEncryptedConnection(peerMac);
}

String EspnowMeshBackend::serializeEncryptedConnection(const uint32_t connectionIndex)
{  
  return EspnowConnectionManager::serializeEncryptedConnection(connectionIndex);
}

void EspnowMeshBackend::setWiFiChannel(const uint8 newWiFiChannel)
{
  MeshBackendBase::setWiFiChannel(newWiFiChannel);
  _database.setWiFiChannel(newWiFiChannel);
}
